events/Annotation Events/Metadata.forumPost/Metadata.forumPost.requestAnnotation.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <s:Header></s:Header>
    <s:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic></wsnt:Topic>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/keui</wsa:Address>
                </wsnt:ProducerReference>
		<wsnt:Message>
                    <ns1:event xmlns:ns1="http://www.alert-project.eu/"	xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki"	xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
                        <ns1:head>
                            <ns1:sender>KEUI</ns1:sender>
                            <ns1:timestamp>10000</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
			</ns1:head>
			<ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
				<ns1:endTime>10010</ns1:endTime>
				<!-- name of event -->
				<ns1:eventName>Metadata.forumPost.requestAnnotation</ns1:eventName>
				<ns1:eventId>5748</ns1:eventId>
				<ns1:eventType>request</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <keui>
                                    <!-- forum item ID -->
                                    <s1:forumItemId>1423</s1:forumItemId>
                                    <!-- forum ID -->
                                    <s1:forumId>3558</s1:forumId>
                                    <!-- thread ID -->
                                    <s1:threadId>3559</s1:threadId>
                                    <!-- post ID -->
                                    <s1:postId>3560</s1:postId>
                                    <!-- time -->
                                    <s1:time>2011-04-15 10:55:57</s1:time>
                                    <!-- subject -->
                                    <s1:subject>This is a test subject for post</s1:subject>
                                    <!-- body -->
                                    <s1:body>This is a test body for post</s1:body>
                                    <!-- author -->
                                    <s1:author>
					<s1:name>Angel Blue</s1:name>
					<s1:id>angel_blue_co2004@yahoo.com</s1:id>
                                        <s1:email>angel_blue_co2004@yahoo.com</s1:email>
                                    </s1:author>
                                    <!-- category -->
                                    <s1:category>xxxxxx</s1:category>
				</keui>
                                <o:mdservice>
                                    <o:forumPostUri>http://www.alert-project.eu/ontologies/alert.owl#post1</o:forumPostUri>
                                    <o:threadUri>http://www.alert-project.eu/ontologies/alert.owl#threads1</o:threadUri>
                                    <o:forumUri>http://www.alert-project.eu/ontologies/alert.owl#forum1</o:forumUri>
                                </o:mdservice>
				<s1:keui>
                                    <!-- item Uri -->
                                    <s1:itemUri></s1:itemUri>
                                    <!-- title annotations -->
                                    <s1:titleAnnotated><![CDATA[This is test <concept uri="http://www.alert-project.eu/ontologies/alert_its.owl#Bug1">annotation</concept> for post title]]></s1:titleAnnotated>
                                    <!-- title concepts -->
                                    <s1:titleConcepts>
                                        <s1:concept>
                                            <s1:uri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug1</s1:uri>
                                            <s1:count>1</s1:count>
                                        </s1:concept>
                                    </s1:titleConcepts>
                                    <!-- body annotations -->
                                    <s1:bodyAnnotated><![CDATA[This is test <concept uri="http://www.alert-project.eu/ontologies/alert_its.owl#Bug1">annotation</concept> for post body]]></s1:bodyAnnotated>
                                    <!-- body concepts -->
                                    <s1:bodyConcepts>
                                        <s1:concept>
                                            <s1:uri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug1</s1:uri>
                                            <s1:count>1</s1:count>
					</s1:concept>
                                    </s1:bodyConcepts>
				</s1:keui>
                            </ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
		</wsnt:Message>
            </wsnt:NotificationMessage>
	</wsnt:Notify>
    </s:Body>
</s:Envelope>